In [1]:
import os
import pandas as pd
import numpy as np
from pydataset import data
from env import get_connection

pd.options.display.max_columns = None

# Acquisition Exercises

## Part 1:

1. Make a new repo called classification-exercises on both GitHub and within your codeup-data-science directory. This will be where you do your work for this module.

In [2]:
#Done

2. Inside of your local classification-exercises repo, create a file named .gitignore with the following contents:

- env.py
- .DS_Store
- .ipynb_checkpoints/
- __pycache__
- *.csv

Add and commit your .gitignore file before moving forward.

In [3]:
#Done

3. Now that you are 100% sure that your .gitignore file lists env.py, create or copy your env.py file inside of classification-exercises. Running git status should show that git is ignoring this file.

In [4]:
#Done

4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [5]:
df_iris = data('iris')
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

- print the first 3 rows

In [6]:
#Seaborn has a slightly different structure:
print(df_iris[0:3])

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

- print the number of rows and columns (shape)

In [7]:
df_iris.shape

(150, 5)

- print the column names

In [8]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

- print the data type of each column

In [9]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- print the summary statistics for each of the numeric variables

In [10]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [11]:
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

5. Read the data from this google sheet into a dataframe, df_google.

In [12]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [13]:
df_google = pd.read_csv(csv_export_url)
#df_google.head()
# Throwing an error "RemoteDisconnected: Remote end closed connection without response"
# For some reason its working now on my home network. That is the only thing that changed.

- print the first 3 rows

In [14]:
print(df_google[0:3])

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

- print the number of rows and columns

In [15]:
df_google.shape

(891, 12)

- print the column names

In [16]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

- print the data type of each column

In [17]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

- print the summary statistics for each of the numeric variables

In [18]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- print the unique values for each of your categorical variables

In [19]:
print("---------------------------------------------------------------")
print(df_google.Name.unique())
print("---------------------------------------------------------------")
print(df_google.Sex.unique())
print("---------------------------------------------------------------")
print(df_google.Ticket.unique())
print("---------------------------------------------------------------")
print(df_google.Cabin.unique())
print("---------------------------------------------------------------")
print(df_google.Embarked.unique())
print("---------------------------------------------------------------")

---------------------------------------------------------------
['Braund, Mr. Owen Harris'
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'
 'Heikkinen, Miss. Laina' 'Futrelle, Mrs. Jacques Heath (Lily May Peel)'
 'Allen, Mr. William Henry' 'Moran, Mr. James' 'McCarthy, Mr. Timothy J'
 'Palsson, Master. Gosta Leonard'
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)'
 'Nasser, Mrs. Nicholas (Adele Achem)' 'Sandstrom, Miss. Marguerite Rut'
 'Bonnell, Miss. Elizabeth' 'Saundercock, Mr. William Henry'
 'Andersson, Mr. Anders Johan' 'Vestrom, Miss. Hulda Amanda Adolfina'
 'Hewlett, Mrs. (Mary D Kingcome) ' 'Rice, Master. Eugene'
 'Williams, Mr. Charles Eugene'
 'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)'
 'Masselmani, Mrs. Fatima' 'Fynney, Mr. Joseph J' 'Beesley, Mr. Lawrence'
 'McGowan, Miss. Anna "Annie"' 'Sloper, Mr. William Thompson'
 'Palsson, Miss. Torborg Danira'
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)'
 'Emir, Mr. Farred Chehab' 'Fortune, Mr. Charles Alexander'
 'O\'Dwyer, Miss. Ellen "Nellie"' 'Todoroff, Mr. Lalio'
 'Uruchurtu, Don. Manuel E'
 'Spencer, Mrs. William Augustus (Marie Eugenie)'
 'Glynn, Miss. Mary Agatha' 'Wheadon, Mr. Edward H'
 'Meyer, Mr. Edgar Joseph' 'Holverson, Mr. Alexander Oskar'
 'Mamee, Mr. Hanna' 'Cann, Mr. Ernest Charles'
 'Vander Planke, Miss. Augusta Maria' 'Nicola-Yarred, Miss. Jamila'
 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)'
 'Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)'
 'Kraeff, Mr. Theodor' 'Laroche, Miss. Simonne Marie Anne Andree'
 'Devaney, Miss. Margaret Delia' 'Rogers, Mr. William John'
 'Lennon, Mr. Denis' "O'Driscoll, Miss. Bridget" 'Samaan, Mr. Youssef'
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)'
 'Panula, Master. Juha Niilo' 'Nosworthy, Mr. Richard Cater'
 'Harper, Mrs. Henry Sleeper (Myna Haxtun)'
 'Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)'
 'Ostby, Mr. Engelhart Cornelius' 'Woolner, Mr. Hugh' 'Rugg, Miss. Emily'
 'Novel, Mr. Mansouer' 'West, Miss. Constance Mirium'
 'Goodwin, Master. William Frederick' 'Sirayanian, Mr. Orsen'
 'Icard, Miss. Amelie' 'Harris, Mr. Henry Birkhardt'
 'Skoog, Master. Harald' 'Stewart, Mr. Albert A'
 'Moubarek, Master. Gerios' 'Nye, Mrs. (Elizabeth Ramell)'
 'Crease, Mr. Ernest James' 'Andersson, Miss. Erna Alexandra'
 'Kink, Mr. Vincenz' 'Jenkin, Mr. Stephen Curnow'
 'Goodwin, Miss. Lillian Amy' 'Hood, Mr. Ambrose Jr'
 'Chronopoulos, Mr. Apostolos' 'Bing, Mr. Lee' 'Moen, Mr. Sigurd Hansen'
 'Staneff, Mr. Ivan' 'Moutal, Mr. Rahamin Haim'
 'Caldwell, Master. Alden Gates' 'Dowdell, Miss. Elizabeth'
 'Waelens, Mr. Achille' 'Sheerlinck, Mr. Jan Baptist'
 'McDermott, Miss. Brigdet Delia' 'Carrau, Mr. Francisco M'
 'Ilett, Miss. Bertha'
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)'
 'Ford, Mr. William Neal' 'Slocovski, Mr. Selman Francis'
 'Fortune, Miss. Mabel Helen' 'Celotti, Mr. Francesco'
 'Christmann, Mr. Emil' 'Andreasson, Mr. Paul Edvin'
 'Chaffee, Mr. Herbert Fuller' 'Dean, Mr. Bertram Frank'
 'Coxon, Mr. Daniel' 'Shorney, Mr. Charles Joseph'
 'Goldschmidt, Mr. George B' 'Greenfield, Mr. William Bertram'
 'Doling, Mrs. John T (Ada Julia Bone)' 'Kantor, Mr. Sinai'
 'Petranec, Miss. Matilda' 'Petroff, Mr. Pastcho ("Pentcho")'
 'White, Mr. Richard Frasar' 'Johansson, Mr. Gustaf Joel'
 'Gustafsson, Mr. Anders Vilhelm' 'Mionoff, Mr. Stoytcho'
 'Salkjelsvik, Miss. Anna Kristine' 'Moss, Mr. Albert Johan'
 'Rekic, Mr. Tido' 'Moran, Miss. Bertha' 'Porter, Mr. Walter Chamberlain'
 'Zabour, Miss. Hileni' 'Barton, Mr. David John' 'Jussila, Miss. Katriina'
 'Attalah, Miss. Malake' 'Pekoniemi, Mr. Edvard' 'Connors, Mr. Patrick'
 'Turpin, Mr. William John Robert' 'Baxter, Mr. Quigg Edmond'
 'Andersson, Miss. Ellis Anna Maria' 'Hickman, Mr. Stanley George'
 'Moore, Mr. Leonard Charles' 'Nasser, Mr. Nicholas' 'Webber, Miss. Susan'
 'White, Mr. Percival Wayland' 'Nicola-Yarred, Master. Elias'
 'McMahon, Mr. Martin' 'Madsen, Mr. Fridtjof Arne' 'Peter, Miss. Anna'
 'Ekstrom, Mr. Johan' 'Drazenoic, Mr. Jozef'
 'Coelho, Mr. Domingos Fernandeo'
 'Robins, Mrs. Alexander A (Grace Charity Laury)'
 'Weisz, Mrs. Leopold (Mathilde Francoise Pede)'
 'Sobey, Mr. Samuel James Hayden' 'Richard, Mr. Emile'
 'Newsom, Miss. Helen Monypeny' 'Futrelle, Mr. Jacques Heath'
 'Osen, Mr. Olaf Elon' 'Giglio, Mr. Victor'
 'Boulos, Mrs. Joseph (Sultana)' 'Nysten, Miss. Anna Sofia'
 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)'
 'Burke, Mr. Jeremiah' 'Andrew, Mr. Edgardo Samuel'
 'Nicholls, Mr. Joseph Charles'
 'Andersson, Mr. August Edvard ("Wennerstrom")'
 'Ford, Miss. Robina Maggie "Ruby"'
 'Navratil, Mr. Michel ("Louis M Hoffman")'
 'Byles, Rev. Thomas Roussel Davids' 'Bateman, Rev. Robert James'
 'Pears, Mrs. Thomas (Edith Wearne)' 'Meo, Mr. Alfonzo'
 'van Billiard, Mr. Austin Blyler' 'Olsen, Mr. Ole Martin'
 'Williams, Mr. Charles Duane' 'Gilnagh, Miss. Katherine "Katie"'
 'Corn, Mr. Harry' 'Smiljanic, Mr. Mile' 'Sage, Master. Thomas Henry'
 'Cribb, Mr. John Hatfield'
 'Watt, Mrs. James (Elizabeth "Bessie" Inglis Milne)'
 'Bengtsson, Mr. John Viktor' 'Calic, Mr. Jovo'
 'Panula, Master. Eino Viljami'
 'Goldsmith, Master. Frank John William "Frankie"'
 'Chibnall, Mrs. (Edith Martha Bowerman)'
 'Skoog, Mrs. William (Anna Bernhardina Karlsson)' 'Baumann, Mr. John D'
 'Ling, Mr. Lee' 'Van der hoef, Mr. Wyckoff' 'Rice, Master. Arthur'
 'Johnson, Miss. Eleanor Ileen' 'Sivola, Mr. Antti Wilhelm'
 'Smith, Mr. James Clinch' 'Klasen, Mr. Klas Albin'
 'Lefebre, Master. Henry Forbes' 'Isham, Miss. Ann Elizabeth'
 'Hale, Mr. Reginald' 'Leonard, Mr. Lionel' 'Sage, Miss. Constance Gladys'
 'Pernot, Mr. Rene' 'Asplund, Master. Clarence Gustaf Hugo'
 'Becker, Master. Richard F' 'Kink-Heilmann, Miss. Luise Gretchen'
 'Rood, Mr. Hugh Roscoe'
 'O\'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)'
 'Romaine, Mr. Charles Hallace ("Mr C Rolmane")' 'Bourke, Mr. John'
 'Turcin, Mr. Stjepan' 'Pinsky, Mrs. (Rosa)' 'Carbines, Mr. William'
 'Andersen-Jensen, Miss. Carla Christine Nielsine'
 'Navratil, Master. Michel M' 'Brown, Mrs. James Joseph (Margaret Tobin)'
 'Lurette, Miss. Elise' 'Mernagh, Mr. Robert'
 'Olsen, Mr. Karl Siegwart Andreas' 'Madigan, Miss. Margaret "Maggie"'
 'Yrois, Miss. Henriette ("Mrs Harbeck")' 'Vande Walle, Mr. Nestor Cyriel'
 'Sage, Mr. Frederick' 'Johanson, Mr. Jakob Alfred' 'Youseff, Mr. Gerious'
 'Cohen, Mr. Gurshon "Gus"' 'Strom, Miss. Telma Matilda'
 'Backstrom, Mr. Karl Alfred' 'Albimona, Mr. Nassef Cassem'
 'Carr, Miss. Helen "Ellen"' 'Blank, Mr. Henry' 'Ali, Mr. Ahmed'
 'Cameron, Miss. Clear Annie' 'Perkin, Mr. John Henry'
 'Givard, Mr. Hans Kristensen' 'Kiernan, Mr. Philip'
 'Newell, Miss. Madeleine' 'Honkanen, Miss. Eliina'
 'Jacobsohn, Mr. Sidney Samuel' 'Bazzani, Miss. Albina'
 'Harris, Mr. Walter' 'Sunderland, Mr. Victor Francis'
 'Bracken, Mr. James H' 'Green, Mr. George Henry' 'Nenkoff, Mr. Christo'
 'Hoyt, Mr. Frederick Maxfield' 'Berglund, Mr. Karl Ivar Sven'
 'Mellors, Mr. William John' 'Lovell, Mr. John Hall ("Henry")'
 'Fahlstrom, Mr. Arne Jonas' 'Lefebre, Miss. Mathilde'
 'Harris, Mrs. Henry Birkhardt (Irene Wallach)' 'Larsson, Mr. Bengt Edvin'
 'Sjostedt, Mr. Ernst Adolf' 'Asplund, Miss. Lillian Gertrud'
 'Leyson, Mr. Robert William Norman' 'Harknett, Miss. Alice Phoebe'
 'Hold, Mr. Stephen' 'Collyer, Miss. Marjorie "Lottie"'
 'Pengelly, Mr. Frederick William' 'Hunt, Mr. George Henry'
 'Zabour, Miss. Thamine' 'Murphy, Miss. Katherine "Kate"'
 'Coleridge, Mr. Reginald Charles' 'Maenpaa, Mr. Matti Alexanteri'
 'Attalah, Mr. Sleiman' 'Minahan, Dr. William Edward'
 'Lindahl, Miss. Agda Thorilda Viktoria' 'Hamalainen, Mrs. William (Anna)'
 'Beckwith, Mr. Richard Leonard' 'Carter, Rev. Ernest Courtenay'
 'Reed, Mr. James George' 'Strom, Mrs. Wilhelm (Elna Matilda Persson)'
 'Stead, Mr. William Thomas' 'Lobb, Mr. William Arthur'
 'Rosblom, Mrs. Viktor (Helena Wilhelmina)'
 'Touma, Mrs. Darwis (Hanne Youssef Razi)'
 'Thorne, Mrs. Gertrude Maybelle' 'Cherry, Miss. Gladys'
 'Ward, Miss. Anna' 'Parrish, Mrs. (Lutie Davis)' 'Smith, Mr. Thomas'
 'Asplund, Master. Edvin Rojj Felix' 'Taussig, Mr. Emil'
 'Harrison, Mr. William' 'Henry, Miss. Delia' 'Reeves, Mr. David'
 'Panula, Mr. Ernesti Arvid' 'Persson, Mr. Ernst Ulrik'
 'Graham, Mrs. William Thompson (Edith Junkins)' 'Bissette, Miss. Amelia'
 'Cairns, Mr. Alexander' 'Tornquist, Mr. William Henry'
 'Mellinger, Mrs. (Elizabeth Anne Maidment)' 'Natsch, Mr. Charles H'
 'Healy, Miss. Hanora "Nora"' 'Andrews, Miss. Kornelia Theodosia'
 'Lindblom, Miss. Augusta Charlotta' 'Parkes, Mr. Francis "Frank"'
 'Rice, Master. Eric' 'Abbott, Mrs. Stanton (Rosa Hunt)'
 'Duane, Mr. Frank' 'Olsson, Mr. Nils Johan Goransson'
 'de Pelsmaeker, Mr. Alfons' 'Dorking, Mr. Edward Arthur'
 'Smith, Mr. Richard William' 'Stankovic, Mr. Ivan'
 'de Mulder, Mr. Theodore' 'Naidenoff, Mr. Penko' 'Hosono, Mr. Masabumi'
 'Connolly, Miss. Kate' 'Barber, Miss. Ellen "Nellie"'
 'Bishop, Mrs. Dickinson H (Helen Walton)' 'Levy, Mr. Rene Jacques'
 'Haas, Miss. Aloisia' 'Mineff, Mr. Ivan' 'Lewy, Mr. Ervin G'
 'Hanna, Mr. Mansour' 'Allison, Miss. Helen Loraine'
 'Saalfeld, Mr. Adolphe' 'Baxter, Mrs. James (Helene DeLaudeniere Chaput)'
 'Kelly, Miss. Anna Katherine "Annie Kate"' 'McCoy, Mr. Bernard'
 'Johnson, Mr. William Cahoone Jr' 'Keane, Miss. Nora A'
 'Williams, Mr. Howard Hugh "Harry"' 'Allison, Master. Hudson Trevor'
 'Fleming, Miss. Margaret'
 'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'
 'Abelson, Mr. Samuel' 'Francatelli, Miss. Laura Mabel'
 'Hays, Miss. Margaret Bechstein' 'Ryerson, Miss. Emily Borie'
 'Lahtinen, Mrs. William (Anna Sylfven)' 'Hendekovic, Mr. Ignjac'
 'Hart, Mr. Benjamin' 'Nilsson, Miss. Helmina Josefina'
 'Kantor, Mrs. Sinai (Miriam Sternin)' 'Moraweck, Dr. Ernest'
 'Wick, Miss. Mary Natalie'
 'Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)'
 'Dennis, Mr. Samuel' 'Danoff, Mr. Yoto' 'Slayter, Miss. Hilda Mary'
 'Caldwell, Mrs. Albert Francis (Sylvia Mae Harbaugh)'
 'Sage, Mr. George John Jr' 'Young, Miss. Marie Grice'
 'Nysveen, Mr. Johan Hansen' 'Ball, Mrs. (Ada E Hall)'
 'Goldsmith, Mrs. Frank John (Emily Alice Brown)'
 'Hippach, Miss. Jean Gertrude' 'McCoy, Miss. Agnes' 'Partner, Mr. Austen'
 'Graham, Mr. George Edward' 'Vander Planke, Mr. Leo Edmondus'
 'Frauenthal, Mrs. Henry William (Clara Heinsheimer)' 'Denkoff, Mr. Mitto'
 'Pears, Mr. Thomas Clinton' 'Burns, Miss. Elizabeth Margaret'
 'Dahl, Mr. Karl Edwart' 'Blackwell, Mr. Stephen Weart'
 'Navratil, Master. Edmond Roger' 'Fortune, Miss. Alice Elizabeth'
 'Collander, Mr. Erik Gustaf' 'Sedgwick, Mr. Charles Frederick Waddington'
 'Fox, Mr. Stanley Hubert' 'Brown, Miss. Amelia "Mildred"'
 'Smith, Miss. Marion Elsie' 'Davison, Mrs. Thomas Henry (Mary E Finck)'
 'Coutts, Master. William Loch "William"' 'Dimic, Mr. Jovan'
 'Odahl, Mr. Nils Martin' 'Williams-Lambert, Mr. Fletcher Fellows'
 'Elias, Mr. Tannous' 'Arnold-Franchi, Mr. Josef' 'Yousif, Mr. Wazli'
 'Vanden Steen, Mr. Leo Peter' 'Bowerman, Miss. Elsie Edith'
 'Funk, Miss. Annie Clemmer' 'McGovern, Miss. Mary'
 'Mockler, Miss. Helen Mary "Ellie"' 'Skoog, Mr. Wilhelm'
 'del Carlo, Mr. Sebastiano' 'Barbara, Mrs. (Catherine David)'
 'Asim, Mr. Adola' "O'Brien, Mr. Thomas" 'Adahl, Mr. Mauritz Nils Martin'
 'Warren, Mrs. Frank Manley (Anna Sophia Atkinson)'
 'Moussa, Mrs. (Mantoura Boulos)' 'Jermyn, Miss. Annie'
 'Aubart, Mme. Leontine Pauline' 'Harder, Mr. George Achilles'
 'Wiklund, Mr. Jakob Alfred' 'Beavan, Mr. William Thomas'
 'Ringhini, Mr. Sante' 'Palsson, Miss. Stina Viola'
 'Meyer, Mrs. Edgar Joseph (Leila Saks)' 'Landergren, Miss. Aurora Adelia'
 'Widener, Mr. Harry Elkins' 'Betros, Mr. Tannous'
 'Gustafsson, Mr. Karl Gideon' 'Bidois, Miss. Rosalie'
 'Nakid, Miss. Maria ("Mary")' 'Tikkanen, Mr. Juho'
 'Holverson, Mrs. Alexander Oskar (Mary Aline Towner)'
 'Plotcharsky, Mr. Vasil' 'Davies, Mr. Charles Henry'
 'Goodwin, Master. Sidney Leonard' 'Buss, Miss. Kate'
 'Sadlier, Mr. Matthew' 'Lehmann, Miss. Bertha'
 'Carter, Mr. William Ernest' 'Jansson, Mr. Carl Olof'
 'Gustafsson, Mr. Johan Birger' 'Newell, Miss. Marjorie'
 'Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengtsson)'
 'Johansson, Mr. Erik' 'Olsson, Miss. Elina' 'McKane, Mr. Peter David'
 'Pain, Dr. Alfred' 'Trout, Mrs. William H (Jessie L)'
 'Niskanen, Mr. Juha' 'Adams, Mr. John' 'Jussila, Miss. Mari Aina'
 'Hakkarainen, Mr. Pekka Pietari' 'Oreskovic, Miss. Marija'
 'Gale, Mr. Shadrach' 'Widegren, Mr. Carl/Charles Peter'
 'Richards, Master. William Rowe' 'Birkeland, Mr. Hans Martin Monsen'
 'Lefebre, Miss. Ida' 'Sdycoff, Mr. Todor' 'Hart, Mr. Henry'
 'Minahan, Miss. Daisy E' 'Cunningham, Mr. Alfred Fleming'
 'Sundman, Mr. Johan Julian' 'Meek, Mrs. Thomas (Annie Louise Rowley)'
 'Drew, Mrs. James Vivian (Lulu Thorne Christian)'
 'Silven, Miss. Lyyli Karoliina' 'Matthews, Mr. William John'
 'Van Impe, Miss. Catharina' 'Gheorgheff, Mr. Stanio'
 'Charters, Mr. David' 'Zimmerman, Mr. Leo'
 'Danbom, Mrs. Ernst Gilbert (Anna Sigrid Maria Brogren)'
 'Rosblom, Mr. Viktor Richard' 'Wiseman, Mr. Phillippe'
 'Clarke, Mrs. Charles V (Ada Maria Winfield)'
 'Phillips, Miss. Kate Florence ("Mrs Kate Louise Phillips Marshall")'
 'Flynn, Mr. James' 'Pickard, Mr. Berk (Berk Trembisky)'
 'Bjornstrom-Steffansson, Mr. Mauritz Hakan'
 'Thorneycroft, Mrs. Percival (Florence Kate White)'
 'Louch, Mrs. Charles Alexander (Alice Adelaide Slow)'
 'Kallio, Mr. Nikolai Erland' 'Silvey, Mr. William Baird'
 'Carter, Miss. Lucile Polk' 'Ford, Miss. Doolina Margaret "Daisy"'
 'Richards, Mrs. Sidney (Emily Hocking)' 'Fortune, Mr. Mark'
 'Kvillner, Mr. Johan Henrik Johannesson'
 'Hart, Mrs. Benjamin (Esther Ada Bloomfield)' 'Hampe, Mr. Leon'
 'Petterson, Mr. Johan Emil' 'Reynaldo, Ms. Encarnacion'
 'Johannesen-Bratthammer, Mr. Bernt' 'Dodge, Master. Washington'
 'Mellinger, Miss. Madeleine Violet' 'Seward, Mr. Frederic Kimber'
 'Baclini, Miss. Marie Catherine' 'Peuchen, Major. Arthur Godfrey'
 'West, Mr. Edwy Arthur' 'Hagland, Mr. Ingvald Olai Olsen'
 'Foreman, Mr. Benjamin Laventall' 'Goldenberg, Mr. Samuel L'
 'Peduzzi, Mr. Joseph' 'Jalsevac, Mr. Ivan' 'Millet, Mr. Francis Davis'
 'Kenyon, Mrs. Frederick R (Marion)' 'Toomey, Miss. Ellen'
 "O'Connor, Mr. Maurice" 'Anderson, Mr. Harry' 'Morley, Mr. William'
 'Gee, Mr. Arthur H' 'Milling, Mr. Jacob Christian' 'Maisner, Mr. Simon'
 'Goncalves, Mr. Manuel Estanslas' 'Campbell, Mr. William'
 'Smart, Mr. John Montgomery' 'Scanlan, Mr. James'
 'Baclini, Miss. Helene Barbara' 'Keefe, Mr. Arthur' 'Cacic, Mr. Luka'
 'West, Mrs. Edwy Arthur (Ada Mary Worth)'
 'Jerwan, Mrs. Amin S (Marie Marthe Thuillard)'
 'Strandberg, Miss. Ida Sofia' 'Clifford, Mr. George Quincy'
 'Renouf, Mr. Peter Henry' 'Braund, Mr. Lewis Richard'
 'Karlsson, Mr. Nils August' 'Hirvonen, Miss. Hildur E'
 'Goodwin, Master. Harold Victor' 'Frost, Mr. Anthony Wood "Archie"'
 'Rouse, Mr. Richard Henry' 'Turkula, Mrs. (Hedwig)'
 'Bishop, Mr. Dickinson H' 'Lefebre, Miss. Jeannie'
 'Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)'
 'Kent, Mr. Edward Austin' 'Somerton, Mr. Francis William'
 'Coutts, Master. Eden Leslie "Neville"'
 'Hagland, Mr. Konrad Mathias Reiersen' 'Windelov, Mr. Einar'
 'Molson, Mr. Harry Markland' 'Artagaveytia, Mr. Ramon'
 'Stanley, Mr. Edward Roland' 'Yousseff, Mr. Gerious'
 'Eustis, Miss. Elizabeth Mussey' 'Shellard, Mr. Frederick William'
 'Allison, Mrs. Hudson J C (Bessie Waldo Daniels)' 'Svensson, Mr. Olof'
 'Calic, Mr. Petar' 'Canavan, Miss. Mary' "O'Sullivan, Miss. Bridget Mary"
 'Laitinen, Miss. Kristina Sofia' 'Maioni, Miss. Roberta'
 'Penasco y Castellana, Mr. Victor de Satode'
 'Quick, Mrs. Frederick Charles (Jane Richards)'
 'Bradley, Mr. George ("George Arthur Brayton")'
 'Olsen, Mr. Henry Margido' 'Lang, Mr. Fang' 'Daly, Mr. Eugene Patrick'
 'Webber, Mr. James' 'McGough, Mr. James Robert'
 'Rothschild, Mrs. Martin (Elizabeth L. Barrett)' 'Coleff, Mr. Satio'
 'Walker, Mr. William Anderson' 'Lemore, Mrs. (Amelia Milley)'
 'Ryan, Mr. Patrick'
 'Angle, Mrs. William A (Florence "Mary" Agnes Hughes)'
 'Pavlovic, Mr. Stefo' 'Perreault, Miss. Anne' 'Vovk, Mr. Janko'
 'Lahoud, Mr. Sarkis' 'Hippach, Mrs. Louis Albert (Ida Sophia Fischer)'
 'Kassem, Mr. Fared' 'Farrell, Mr. James' 'Ridsdale, Miss. Lucy'
 'Farthing, Mr. John' 'Salonen, Mr. Johan Werner'
 'Hocking, Mr. Richard George' 'Quick, Miss. Phyllis May'
 'Toufik, Mr. Nakli' 'Elias, Mr. Joseph Jr'
 'Peter, Mrs. Catherine (Catherine Rizk)' 'Cacic, Miss. Marija'
 'Hart, Miss. Eva Miriam' 'Butt, Major. Archibald Willingham'
 'LeRoy, Miss. Bertha' 'Risien, Mr. Samuel Beard'
 'Frolicher, Miss. Hedwig Margaritha' 'Crosby, Miss. Harriet R'
 'Andersson, Miss. Ingeborg Constanzia'
 'Andersson, Miss. Sigrid Elisabeth' 'Beane, Mr. Edward'
 'Douglas, Mr. Walter Donald' 'Nicholson, Mr. Arthur Ernest'
 'Beane, Mrs. Edward (Ethel Clarke)' 'Padro y Manent, Mr. Julian'
 'Goldsmith, Mr. Frank John' 'Davies, Master. John Morgan Jr'
 'Thayer, Mr. John Borland Jr' 'Sharp, Mr. Percival James R'
 "O'Brien, Mr. Timothy" 'Leeni, Mr. Fahim ("Philip Zenni")'
 'Ohman, Miss. Velin' 'Wright, Mr. George'
 'Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")'
 'Robbins, Mr. Victor' 'Taussig, Mrs. Emil (Tillie Mandelbaum)'
 'de Messemaeker, Mrs. Guillaume Joseph (Emma)' 'Morrow, Mr. Thomas Rowan'
 'Sivic, Mr. Husein' 'Norman, Mr. Robert Douglas' 'Simmons, Mr. John'
 'Meanwell, Miss. (Marion Ogden)' 'Davies, Mr. Alfred J'
 'Stoytcheff, Mr. Ilia' 'Palsson, Mrs. Nils (Alma Cornelia Berglund)'
 'Doharr, Mr. Tannous' 'Jonsson, Mr. Carl' 'Harris, Mr. George'
 'Appleton, Mrs. Edward Dale (Charlotte Lamson)'
 'Flynn, Mr. John Irwin ("Irving")' 'Kelly, Miss. Mary'
 'Rush, Mr. Alfred George John' 'Patchett, Mr. George'
 'Garside, Miss. Ethel' 'Silvey, Mrs. William Baird (Alice Munger)'
 'Caram, Mrs. Joseph (Maria Elias)' 'Jussila, Mr. Eiriik'
 'Christy, Miss. Julie Rachel'
 'Thayer, Mrs. John Borland (Marian Longstreth Morris)'
 'Downton, Mr. William James' 'Ross, Mr. John Hugo' 'Paulner, Mr. Uscher'
 'Taussig, Miss. Ruth' 'Jarvis, Mr. John Denzil'
 'Frolicher-Stehli, Mr. Maxmillian' 'Gilinski, Mr. Eliezer'
 'Murdlin, Mr. Joseph' 'Rintamaki, Mr. Matti'
 'Stephenson, Mrs. Walter Bertram (Martha Eustis)'
 'Elsbury, Mr. William James' 'Bourke, Miss. Mary'
 'Chapman, Mr. John Henry' 'Van Impe, Mr. Jean Baptiste'
 'Leitch, Miss. Jessie Wills' 'Johnson, Mr. Alfred' 'Boulos, Mr. Hanna'
 'Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")'
 'Jacobsohn, Mrs. Sidney Samuel (Amy Frances Christy)'
 'Slabenoff, Mr. Petco' 'Harrington, Mr. Charles H'
 'Torber, Mr. Ernst William' 'Homer, Mr. Harry ("Mr E Haven")'
 'Lindell, Mr. Edvard Bengtsson' 'Karaic, Mr. Milan'
 'Daniel, Mr. Robert Williams'
 'Laroche, Mrs. Joseph (Juliette Marie Louise Lafargue)'
 'Shutes, Miss. Elizabeth W'
 'Andersson, Mrs. Anders Johan (Alfrida Konstantia Brogren)'
 'Jardin, Mr. Jose Neto' 'Murphy, Miss. Margaret Jane' 'Horgan, Mr. John'
 'Brocklebank, Mr. William Alfred' 'Herman, Miss. Alice'
 'Danbom, Mr. Ernst Gilbert'
 'Lobb, Mrs. William Arthur (Cordelia K Stanlick)'
 'Becker, Miss. Marion Louise' 'Gavey, Mr. Lawrence' 'Yasbeck, Mr. Antoni'
 'Kimball, Mr. Edwin Nelson Jr' 'Nakid, Mr. Sahid'
 'Hansen, Mr. Henry Damsgaard' 'Bowen, Mr. David John "Dai"'
 'Sutton, Mr. Frederick' 'Kirkland, Rev. Charles Leonard'
 'Longley, Miss. Gretchen Fiske' 'Bostandyeff, Mr. Guentcho'
 "O'Connell, Mr. Patrick D" 'Barkworth, Mr. Algernon Henry Wilson'
 'Lundahl, Mr. Johan Svensson' 'Stahelin-Maeglin, Dr. Max'
 'Parr, Mr. William Henry Marsh' 'Skoog, Miss. Mabel' 'Davis, Miss. Mary'
 'Leinonen, Mr. Antti Gustaf' 'Collyer, Mr. Harvey'
 'Panula, Mrs. Juha (Maria Emilia Ojala)' 'Thorneycroft, Mr. Percival'
 'Jensen, Mr. Hans Peder' 'Sagesser, Mlle. Emma'
 'Skoog, Miss. Margit Elizabeth' 'Foo, Mr. Choong'
 'Baclini, Miss. Eugenie' 'Harper, Mr. Henry Sleeper' 'Cor, Mr. Liudevit'
 'Simonius-Blumer, Col. Oberst Alfons' 'Willey, Mr. Edward'
 'Stanley, Miss. Amy Zillah Elsie' 'Mitkoff, Mr. Mito'
 'Doling, Miss. Elsie' 'Kalvik, Mr. Johannes Halvorsen'

In [20]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [21]:
# You would have to do this for each column:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

6. Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [22]:
df_excel = pd.read_excel('train.xlsx', sheet_name='train')
df_excel.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- assign the first 100 rows to a new dataframe, df_excel_sample

In [23]:
df_excel_sample = df_excel[0:100]
df_excel_sample.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0000,NaN,S

- print the number of rows of your original dataframe

In [24]:
df_excel.shape[0]

891

- print the first 5 column names

In [25]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

- print the column names that have a data type of object

In [26]:
df_object = df_excel.dtypes == 'object'
df_object[df_object == True]

Name        True
Sex         True
Ticket      True
Cabin       True
Embarked    True
dtype: bool

- compute the range for each of the numeric variables.

In [27]:
# You could use the df_excel.describe().T to flip the rows/columns.

In [28]:
df_range = df_excel.describe().loc['max'] - df_excel.describe().loc['min']
df_range

PassengerId    890.0000
Survived         1.0000
Pclass           2.0000
Age             79.5800
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

## Part 2:

Make a new python module, acquire.py to hold the following data aquisition functions:

1. Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [29]:
def get_titanic_data():
    
    """
    This function reads the titanic data from Codeup db into a df.
    """
    filename = "titanic.csv"
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)
        
        # Return the dataframe to the calling code
        return df

In [30]:
titanic_df = get_titanic_data()

In [31]:
titanic_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

2. Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [32]:
def get_iris_data():
    """
    This function reads the iris data from Codeup db into a df.
    """
    filename = "iris.csv"
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        query = """
        SELECT sepal_length, sepal_width, petal_length, petal_width, species_name, species_id FROM measurements
        LEFT JOIN species USING (species_id);
        """
        # read the SQL query into a dataframe
        df = pd.read_sql(query, get_connection('iris_db'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)
        
        # Return the dataframe to the calling code
        return df

In [33]:
iris_df = get_iris_data()
iris_df.head()

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species_name,species_id
0,0,5.1,3.5,1.4,0.2,setosa,1
1,1,4.9,3.0,1.4,0.2,setosa,1
2,2,4.7,3.2,1.3,0.2,setosa,1
3,3,4.6,3.1,1.5,0.2,setosa,1
4,4,5.0,3.6,1.4,0.2,setosa,1

3. Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join contract_types, internet_service_types, payment_types tables with the customers table, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [34]:
def get_telco_data():
    """
    This function reads the telco_churn data from Codeup db into a df.
    """
    filename = "telco_churn.csv"
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        query = """
        SELECT * FROM customers 
        LEFT JOIN contract_types USING (contract_type_id)
        LEFT JOIN internet_service_types USING (internet_service_type_id)
        LEFT JOIN payment_types USING (payment_type_id);
        """
        df = pd.read_sql(query, get_connection('telco_churn'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)
        
        # Return the dataframe to the calling code
        return df

In [35]:
telco_df = get_telco_data()

In [36]:
telco_df.head()

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

4. Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [37]:
# Done

# Preparation Exercises

In [38]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

# turn off pink boxes for demo
import warnings
warnings.filterwarnings("ignore")

# import our own acquire module
import acquire
import prepare

Using the Iris Data:

1. Use the function defined in acquire.py to load the iris data.

In [39]:
iris = acquire.get_iris_data()

In [40]:
iris.head()

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species_name,species_id
0,0,5.1,3.5,1.4,0.2,setosa,1
1,1,4.9,3.0,1.4,0.2,setosa,1
2,2,4.7,3.2,1.3,0.2,setosa,1
3,3,4.6,3.1,1.5,0.2,setosa,1
4,4,5.0,3.6,1.4,0.2,setosa,1

2. Drop the species_id and measurement_id columns.

In [41]:
cols_to_drop = ['Unnamed: 0', 'species_id'] #Never imported the measurements_id column

In [42]:
iris = iris.drop(columns=cols_to_drop)

In [43]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species_name'],
      dtype='object')

3. Rename the species_name column to just species.

In [44]:
iris.rename(columns={'species_name':'species'}, inplace=True)

4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [45]:
dummy_df = pd.get_dummies(iris[['species']], drop_first=True)

In [46]:
dummy_df.sample(5)

     species_versicolor  species_virginica
134                   0                  1
26                    0                  0
119                   0                  1
8                     0                  0
33                    0                  0

In [47]:
iris = pd.concat([iris, dummy_df], axis=1)

In [48]:
iris.sample(5)

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
119,6.0,2.2,5.0,1.5,virginica,0,1
51,6.4,3.2,4.5,1.5,versicolor,1,0
124,6.7,3.3,5.7,2.1,virginica,0,1
38,4.4,3.0,1.3,0.2,setosa,0,0
140,6.7,3.1,5.6,2.4,virginica,0,1

5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [49]:
def prep_iris(df):
    """ 
    This function takes a dataframe from the iris dataset 
    containing the sepal_length, sepal_width, petal_length, 
    petal_width, species_name, species_id columns and returns 
    a cleaner dataset.
    """
    #Assigns column to a list and drops species_id:
    cols_to_drop = ['species_id'] #Never imported the measurements_id column
    df = df.drop(columns=cols_to_drop)
    
    #Shortens the species column name:
    df.rename(columns={'species_name':'species'}, inplace=True)
    
    #Assigns two dummy columns and attach them to the dataframe.
    dummy_df = pd.get_dummies(df[['species']], drop_first=True)
    df = pd.concat([df, dummy_df], axis=1)
    return df

In [50]:
iris_test = acquire.get_iris_data()
iris_test = prep_iris(iris_test)

In [51]:
iris_test.sample(5)

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
52,52,6.9,3.1,4.9,1.5,versicolor,1,0
14,14,5.8,4.0,1.2,0.2,setosa,0,0
96,96,5.7,2.9,4.2,1.3,versicolor,1,0
22,22,4.6,3.6,1.0,0.2,setosa,0,0
53,53,5.5,2.3,4.0,1.3,versicolor,1,0

Using the Titanic dataset

1. Use the function defined in acquire.py to load the Titanic data.

In [52]:
titanic_df = get_titanic_data()
titanic_df.sample(5)

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
699,699,699,0,3,male,42.0,0,0,7.6500,S,Third,F,Southampton,1
601,601,601,0,3,male,NaN,0,0,7.8958,S,Third,NaN,Southampton,1
259,259,259,1,2,female,50.0,0,1,26.0000,S,Second,NaN,Southampton,0
50,50,50,0,3,male,7.0,4,1,39.6875,S,Third,NaN,Southampton,0
135,135,135,0,2,male,23.0,0,0,15.0458,C,Second,NaN,Cherbourg,1

2. Drop any unnecessary, unhelpful, or duplicated columns.

In [53]:
cols_to_drop = ['Unnamed: 0', 'passenger_id', 'age', 'embarked', 'class', 'deck']

In [54]:
titanic_df.drop(columns=cols_to_drop, inplace = True)

In [55]:
titanic_df.sample(5)

     survived  pclass   sex  sibsp  parch    fare  embark_town  alone
158         0       3  male      0      0  8.6625  Southampton      1
231         0       3  male      0      0  7.7750  Southampton      1
884         0       3  male      0      0  7.0500  Southampton      1
121         0       3  male      0      0  8.0500  Southampton      1
584         0       3  male      0      0  8.7125    Cherbourg      1

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [56]:
dummy_df = pd.get_dummies(titanic_df[['sex', 'embark_town']], drop_first=True)

In [57]:
titanic_df = pd.concat([titanic_df, dummy_df], axis=1)

In [58]:
titanic_df.sample(5)

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
736,0,3,female,1,3,34.375,Southampton,0,0,0,1
162,0,3,male,0,0,7.775,Southampton,1,1,0,1
23,1,1,male,0,0,35.500,Southampton,1,1,0,1
597,0,3,male,0,0,0.000,Southampton,1,1,0,1
593,0,3,female,0,2,7.750,Queenstown,0,0,1,0

4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [59]:
def prep_titanic(df):
    """
    This function takes a dataframe with the titantic data set
    and areturns a cleaner version.
    """
    
    cols_to_drop = ['Unnamed: 0', 'passenger_id', 'age', 'embarked', 'class', 'deck']
    df.drop(columns=cols_to_drop, inplace = True)
    dummy_df = pd.get_dummies(df[['sex', 'embark_town']], drop_first=True)
    df = pd.concat([df, dummy_df], axis=1)
    return df

In [60]:
test_df = get_titanic_data()
prep_titanic(test_df)

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,0,3,male,0,0,8.0500,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Southampton,1,1,0,1
887,1,1,female,0,0,30.0000,Southampton,1,0,0,1
888,0,3,female,1,2,23.4500,Southampton,0,0,0,1
889,1,1,male,0,0,30.0000,Cherbourg,1,1,0,0
890,0,3,male,0,0,7.7500,Queenstown,1,1,1,0

Using the Telco dataset

1. Use the function defined in acquire.py to load the Telco data.

In [61]:
telco_df = get_telco_data()

In [62]:
telco_df.columns

Index(['Unnamed: 0', 'payment_type_id', 'internet_service_type_id',
       'contract_type_id', 'customer_id', 'gender', 'senior_citizen',
       'partner', 'dependents', 'tenure', 'phone_service', 'multiple_lines',
       'online_security', 'online_backup', 'device_protection', 'tech_support',
       'streaming_tv', 'streaming_movies', 'paperless_billing',
       'monthly_charges', 'total_charges', 'churn', 'contract_type',
       'internet_service_type', 'payment_type'],
      dtype='object')

2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [63]:
cols_to_drop = ['Unnamed: 0', 'customer_id', 'payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id']

In [64]:
telco_df.drop(columns=cols_to_drop, inplace = True)

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [65]:
encode_list = ['churn', 'paperless_billing', 'partner' , 'dependents']

In [66]:
for col in telco_df.columns:
    if col in encode_list:
        telco_df[col] = telco_df[col].replace({'Yes':True,'No':False}).astype('int')

In [67]:
dummy_df = (pd.get_dummies(telco_df[['gender', 'partner', 'streaming_movies', 
                                     'streaming_tv' , 'tech_support', 'dependents', 'multiple_lines', 
                                     'online_backup', 'online_security', 'device_protection', 
                                     'payment_type', 'internet_service_type', 'contract_type']], drop_first=True))
telco_df = pd.concat([telco_df, dummy_df], axis=1)

In [68]:
telco_df.sample(5)

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type,partner,dependents,gender_Male,streaming_movies_No internet service,streaming_movies_Yes,streaming_tv_No internet service,streaming_tv_Yes,tech_support_No internet service,tech_support_Yes,multiple_lines_No phone service,multiple_lines_Yes,online_backup_No internet service,online_backup_Yes,online_security_No internet service,online_security_Yes,device_protection_No internet service,device_protection_Yes,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check,internet_service_type_Fiber optic,internet_service_type_None,contract_type_One year,contract_type_Two year
2947,Female,0,0,0,12,No,No phone service,Yes,No,No,Yes,No,No,1,33.60,435.45,0,One year,DSL,Mailed check,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,0,0,0,0,1,0,0,1,0
5139,Male,0,0,0,4,Yes,No,No internet service,No internet service,No internet service,No internet service,No internet service,No internet service,0,19.00,73.45,0,Month-to-month,None,Mailed check,0,0,1,1,0,1,0,1,0,0,0,1,0,1,0,1,0,0,0,1,0,1,0,0
1534,Male,0,0,1,38,Yes,Yes,No,Yes,No,No,No,No,1,81.85,3141.7,0,Month-to-month,Fiber optic,Mailed check,0,1,1,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,1,1,0,0,0
3919,Male,0,0,0,8,Yes,No,No,No,No,No,No,Yes,1,54.75,438.05,0,Month-to-month,DSL,Credit card (automatic),0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
2343,Male,0,0,0,40,Yes,Yes,No,Yes,Yes,No,Yes,Yes,1,102.65,4108.15,0,Month-to-month,Fiber optic,Mailed check,0,0,1,0,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,1,1,0,0,0

4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [69]:
def prep_telco(working_df):
    
    
    cols_to_drop = ['Unnamed: 0', 'customer_id', 'payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id']
    
    working_df.drop(columns=cols_to_drop, inplace = True)
    
    encode_list = ['churn', 'paperless_billing', 'partner' , 'dependents']
    
    for col in working_df.columns:
        if col in encode_list:
            working_df[col] = working_df[col].replace({'Yes':True,'No':False}).astype('int')
            
    dummy_df = (pd.get_dummies(working_df[['gender', 'partner', 'streaming_movies', 'streaming_tv' , 'tech_support','dependents', 'multiple_lines', 'online_backup', 'online_security', 'device_protection', 'payment_type', 'internet_service_type', 'contract_type']], drop_first=True))
    
    working_df = pd.concat([working_df, dummy_df], axis=1)
    
    return working_df

Split your data

1. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

In [70]:
# 20% test, 80% train_validate
# then of the 80% train_validate: 30% validate, 70% train. 
def train_validate(df, stratify_col = None):
    """
    This function takes in a DataFrame and column name for the stratify argument (defualt is None).
    It will split the data into three parts for training, testing and validating.
    """
    #This is logic to set the stratify argument:
    stratify_arg = ''
    if stratify_col != None:
        stratify_arg = df[stratify_col]
    else:
        stratify_arg = None
    
    #This splits the DataFrame into 'train' and 'test':
    train, test = train_test_split(df, test_size=.2, random_state=123, stratify=stratify_arg)
    
    #The length of the stratify column changed and needs to be adjusted:
    if stratify_col != None:
        stratify_arg = train[stratify_col]
        
    #This splits the larger 'train' DataFrame into a smaller 'train' and 'validate' DataFrames:
    train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=stratify_arg)
    return train, validate, test

2. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

In [71]:
df = acquire.get_iris_data()

In [72]:
df = prepare.prep_iris(df)

In [73]:
df.sample(5)

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
8,4.4,2.9,1.4,0.2,setosa,0,0
15,5.7,4.4,1.5,0.4,setosa,0,0
49,5.0,3.3,1.4,0.2,setosa,0,0
53,5.5,2.3,4.0,1.3,versicolor,1,0
16,5.4,3.9,1.3,0.4,setosa,0,0

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sepal_length        150 non-null    float64
 1   sepal_width         150 non-null    float64
 2   petal_length        150 non-null    float64
 3   petal_width         150 non-null    float64
 4   species             150 non-null    object
 5   species_versicolor  150 non-null    uint8
 6   species_virginica   150 non-null    uint8
dtypes: float64(4), object(1), uint8(2)
memory usage: 6.3+ KB

In [75]:
train_iris, validate_iris, test_iris = train_validate(df, stratify_col = 'species')

In [76]:
train_iris.info(), validate_iris.info(), test_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 84 entries, 79 to 73
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sepal_length        84 non-null     float64
 1   sepal_width         84 non-null     float64
 2   petal_length        84 non-null     float64
 3   petal_width         84 non-null     float64
 4   species             84 non-null     object
 5   species_versicolor  84 non-null     uint8
 6   species_virginica   84 non-null     uint8
dtypes: float64(4), object(1), uint8(2)
memory usage: 4.1+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 36 entries, 134 to 124
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sepal_length        36 non-null     float64
 1   sepal_width         36 non-null     float64
 2   petal_length        36 non-null     float64
 3   petal_width         36 non-null     float64
 4   species             36 non-null     object
 5   species_versicolor  36 non-null     uint8
 6   species_virginica   36 non-null     uint8
dtypes: float64(4), object(1), uint8(2)
memory usage: 1.8+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 80 to 65
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   sepal_length        30 non-null     float64
 1   sepal_width         30 non-null     float64
 2   petal_length        30 non-null     float64
 3   petal_width         30 non-null     float64
 4   species             30 non-null     object
 5   species_versicolor  30 non-null     uint8
 6   species_virginica   30 non-null     uint8
dtypes: float64(4), object(1), uint8(2)
memory usage: 1.5+ KB

(None, None, None)

3. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

In [77]:
df = acquire.get_titanic_data()
df = prepare.prep_titanic(df)

In [78]:
train_titanic, validate_titanic, test_titanic = train_validate(df, 'survived')

In [79]:
train_titanic.info(), validate_titanic.info(), test_titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 498 entries, 583 to 744
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   survived                 498 non-null    int64
 1   pclass                   498 non-null    int64
 2   sex                      498 non-null    object
 3   sibsp                    498 non-null    int64
 4   parch                    498 non-null    int64
 5   fare                     498 non-null    float64
 6   embark_town              497 non-null    object
 7   alone                    498 non-null    int64
 8   sex_male                 498 non-null    uint8
 9   embark_town_Queenstown   498 non-null    uint8
 10  embark_town_Southampton  498 non-null    uint8
dtypes: float64(1), int64(5), object(2), uint8(3)
memory usage: 36.5+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 214 entries, 610 to 26
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   survived                 214 non-null    int64
 1   pclass                   214 non-null    int64
 2   sex                      214 non-null    object
 3   sibsp                    214 non-null    int64
 4   parch                    214 non-null    int64
 5   fare                     214 non-null    float64
 6   embark_town              213 non-null    object
 7   alone                    214 non-null    int64
 8   sex_male                 214 non-null    uint8
 9   embark_town_Queenstown   214 non-null    uint8
 10  embark_town_Southampton  214 non-null    uint8
dtypes: float64(1), int64(5), object(2), uint8(3)
memory usage: 15.7+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 179 entries, 561 to 53
Data columns (total 11 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   survived                 179 non-null    int64
 1   pclass                   179 non-null    int64
 2   sex                      179 non-null    object
 3   sibsp                    179 non-null    int64
 4   parch                    179 non-null    int64
 5   fare                     179 non-null    float64
 6   embark_town              179 non-null    object
 7   alone                    179 non-null    int64
 8   sex_male                 179 non-null    uint8
 9   embark_town_Queenstown   179 non-null    uint8
 10  embark_town_Southampton  179 non-null    uint8
dtypes: float64(1), int64(5), object(2), uint8(3)
memory usage: 13.1+ KB

(None, None, None)

4. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [80]:
df = acquire.get_telco_data()
df = prepare.prep_telco(df)

In [81]:
train_telco, validate_telco, test_telco = train_validate(df, 'churn')

In [82]:
train_telco.info(), validate_telco.info(), test_telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3943 entries, 5310 to 6817
Data columns (total 44 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   gender                                 3943 non-null   object
 1   senior_citizen                         3943 non-null   int64
 2   partner                                3943 non-null   int64
 3   dependents                             3943 non-null   int64
 4   tenure                                 3943 non-null   int64
 5   phone_service                          3943 non-null   object
 6   multiple_lines                         3943 non-null   object
 7   online_security                        3943 non-null   object
 8   online_backup                          3943 non-null   object
 9   device_protection                      3943 non-null   object
 10  tech_support                           3943 non-null   object
 11  streaming_tv                           3943 non-null   object
 12  streaming_movies                       3943 non-null   object
 13  paperless_billing                      3943 non-null   int64
 14  monthly_charges                        3943 non-null   float64
 15  total_charges                          3943 non-null   float64
 16  churn                                  3943 non-null   int64
 17  contract_type                          3943 non-null   object
 18  internet_service_type                  3943 non-null   object
 19  payment_type                           3943 non-null   object
 20  partner                                3943 non-null   int64
 21  dependents                             3943 non-null   int64
 22  gender_Male                            3943 non-null   uint8
 23  streaming_movies_No internet service   3943 non-null   uint8
 24  streaming_movies_Yes                   3943 non-null   uint8
 25  streaming_tv_No internet service       3943 non-null   uint8
 26  streaming_tv_Yes                       3943 non-null   uint8
 27  tech_support_No internet service       3943 non-null   uint8
 28  tech_support_Yes                       3943 non-null   uint8
 29  multiple_lines_No phone service        3943 non-null   uint8
 30  multiple_lines_Yes                     3943 non-null   uint8
 31  online_backup_No internet service      3943 non-null   uint8
 32  online_backup_Yes                      3943 non-null   uint8
 33  online_security_No internet service    3943 non-null   uint8
 34  online_security_Yes                    3943 non-null   uint8
 35  device_protection_No internet service  3943 non-null   uint8
 36  device_protection_Yes                  3943 non-null   uint8
 37  payment_type_Credit card (automatic)   3943 non-null   uint8
 38  payment_type_Electronic check          3943 non-null   uint8
 39  payment_type_Mailed check              3943 non-null   uint8
 40  internet_service_type_Fiber optic      3943 non-null   uint8
 41  internet_service_type_None             3943 non-null   uint8
 42  contract_type_One year                 3943 non-null   uint8
 43  contract_type_Two year                 3943 non-null   uint8
dtypes: float64(2), int64(8), object(12), uint8(22)
memory usage: 793.2+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1691 entries, 720 to 3333
Data columns (total 44 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   gender                                 1691 non-null   object
 1   senior_citizen                         1691 non-null   int64
 2   partner                                1691 non-null   int64
 3   dependents                             1691 non-null   int64
 4   tenure                                 1691 non-null   int64
 5   phone_service                          1691 non-null   object
 6   multiple_lines                         1691 non-null   object
 7   online_security                        1691 non-null   object
 8   online_backup                          1691 non-null   object
 9   device_protection                      1691 non-null   object
 10  tech_support                           1691 non-null   object
 11  streaming_tv                           1691 non-null   object
 12  streaming_movies                       1691 non-null   object
 13  paperless_billing                      1691 non-null   int64
 14  monthly_charges                        1691 non-null   float64
 15  total_charges                          1691 non-null   float64
 16  churn                                  1691 non-null   int64
 17  contract_type                          1691 non-null   object
 18  internet_service_type                  1691 non-null   object
 19  payment_type                           1691 non-null   object
 20  partner                                1691 non-null   int64
 21  dependents                             1691 non-null   int64
 22  gender_Male                            1691 non-null   uint8
 23  streaming_movies_No internet service   1691 non-null   uint8
 24  streaming_movies_Yes                   1691 non-null   uint8
 25  streaming_tv_No internet service       1691 non-null   uint8
 26  streaming_tv_Yes                       1691 non-null   uint8
 27  tech_support_No internet service       1691 non-null   uint8
 28  tech_support_Yes                       1691 non-null   uint8
 29  multiple_lines_No phone service        1691 non-null   uint8
 30  multiple_lines_Yes                     1691 non-null   uint8
 31  online_backup_No internet service      1691 non-null   uint8
 32  online_backup_Yes                      1691 non-null   uint8
 33  online_security_No internet service    1691 non-null   uint8
 34  online_security_Yes                    1691 non-null   uint8
 35  device_protection_No internet service  1691 non-null   uint8
 36  device_protection_Yes                  1691 non-null   uint8
 37  payment_type_Credit card (automatic)   1691 non-null   uint8
 38  payment_type_Electronic check          1691 non-null   uint8
 39  payment_type_Mailed check              1691 non-null   uint8
 40  internet_service_type_Fiber optic      1691 non-null   uint8
 41  internet_service_type_None             1691 non-null   uint8
 42  contract_type_One year                 1691 non-null   uint8
 43  contract_type_Two year                 1691 non-null   uint8
dtypes: float64(2), int64(8), object(12), uint8(22)
memory usage: 340.2+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1409 entries, 3160 to 983
Data columns (total 44 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   gender                                 1409 non-null   object
 1   senior_citizen                         1409 non-null   int64
 2   partner                                1409 non-null   int64
 3   dependents                             1409 non-null   int64
 4   tenure                                 1409 non-null   int64
 5   phone_service                          1409 non-null   object
 6   multiple_lines                         1409 non-null   object
 7   online_security                        1409 non-null   object
 8   online_backup                          1409 non-null   object
 9   device_protection                      1409 non-null   object
 10  tech_support                           1409 non-null   object
 11  streaming_tv                           1409 non-null   object
 12  streaming_movies                       1409 non-null   object
 13  paperless_billing                      1409 non-null   int64
 14  monthly_charges                        1409 non-null   float64
 15  total_charges                          1409 non-null   float64
 16  churn                                  1409 non-null   int64
 17  contract_type                          1409 non-null   object
 18  internet_service_type                  1409 non-null   object
 19  payment_type                           1409 non-null   object
 20  partner                                1409 non-null   int64
 21  dependents                             1409 non-null   int64
 22  gender_Male                            1409 non-null   uint8
 23  streaming_movies_No internet service   1409 non-null   uint8
 24  streaming_movies_Yes                   1409 non-null   uint8
 25  streaming_tv_No internet service       1409 non-null   uint8
 26  streaming_tv_Yes                       1409 non-null   uint8
 27  tech_support_No internet service       1409 non-null   uint8
 28  tech_support_Yes                       1409 non-null   uint8
 29  multiple_lines_No phone service        1409 non-null   uint8
 30  multiple_lines_Yes                     1409 non-null   uint8
 31  online_backup_No internet service      1409 non-null   uint8
 32  online_backup_Yes                      1409 non-null   uint8
 33  online_security_No internet service    1409 non-null   uint8
 34  online_security_Yes                    1409 non-null   uint8
 35  device_protection_No internet service  1409 non-null   uint8
 36  device_protection_Yes                  1409 non-null   uint8
 37  payment_type_Credit card (automatic)   1409 non-null   uint8
 38  payment_type_Electronic check          1409 non-null   uint8
 39  payment_type_Mailed check              1409 non-null   uint8
 40  internet_service_type_Fiber optic      1409 non-null   uint8
 41  internet_service_type_None             1409 non-null   uint8
 42  contract_type_One year                 1409 non-null   uint8
 43  contract_type_Two year                 1409 non-null   uint8
dtypes: float64(2), int64(8), object(12), uint8(22)
memory usage: 283.5+ KB

(None, None, None)